[
    {
        "company": "OYO Rooms",
        "company_location": "Gurgaon, IN",
        "role": "Software Development Engineer",
        "team": "Data Science",
        "time_duration": "Jan 2020 - Jan 2021",
        "details": [
        	{
                "title": "Third Party Client Business Insights Portal",
                "description": "Responsible for API design, development, testing, code quality and deployment of RESTful services for the enterprise product in the business. Interacted with the Product team to finalize the logical flow of the API after understanding business requirements.",
                "languages":"Springboot (Java), Python"
            },
        	{
                "title": "Data ingestion and  migration",
                "description": "Developed Kafka producer application to send messages from PostgresDB to Kafka topics in JSON format. Create and maintainance of cronjobs to send data of all the properties downstream by publishing data using Kafka. Formulated Python scripts that migrated data into existing schema from a CSV file using pandas and psycopg2.",
                "languages": "Springboot (Java), Python"
            },
            {
                "title": "Miscellaneous",
                "description": "Performed on-call duties. Leveraged project management software JIRA to track the progress of the project and Git for version control.",
                "languages": ""
            }
        ]
    },
    {
        "company": "OYO Rooms",
        "company_location": "Gurgaon, IN",
        "role": "Data Support Engineer (Business)",
        "team": "Conversion",
        "time_duration": "July 2019 - Jan 2020",
        "details": [
            {
                "title": "Meta channel growth",
                "description": "Utilised data-driven insights to optimize listings and drive bookings on online travel agencies and meta-search engines. Conducted data analysis, implemented KPIs, developed dashboards, and collaborated with cross-functional teams to drive continuous improvement and informed decision-making.",
                "languages": "Python, R"
            },
            {
                    "title": "Dashboard management and data supply",
                    "description": "SPOC for all the online conversion and revenue related Automated Dashboards and setting up Triggers for business tracking and alerts, leading numerous RCAs and Business Insights, issues with landing pages, SEO and SEA keyword performance analysis, etc. and using other agency tools like AWS EC2, Lambda functions, GCP cloud functions and Hive data tools.",
                    "languages": "Python, R, ShellScripting, SQL, Excel, Google Analytics"
            }
        ]
    },
    {
        "company": "Vijayawada Muncipal Corporation",
        "company_location": "Vijayawada, IN",
        "role": "Web development",
        "team": "Freelancing",
        "time_duration": "May 2022 - June 2022",
        "details": [
            {
                "title": "Protrack: Employee management system",
                "description": "Developing a full stack application for Vijayawada Municipal Corporation(VMC) to track the progress of their various works and projects which helps in monitoring the performance of the employees (used by more than 100 different employed people of VMC). Led training, supervision, and project handover to a team of two recent graduates.",
                "languages": "Springboot, MySQL, NodeJs, ReactJs, Docker"
            }
        ]
    }
]
